Summary:

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 32)      896       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 64)      18496     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       73856     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 256)       295168    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 256)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 14, 14, 512)       1180160   
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 7, 7, 512)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 1024)        4719616   
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 3, 3, 1024)        0         
_________________________________________________________________
flatten (Flatten)            (None, 9216)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               1179776   
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 774       
=================================================================
Total params: 7,468,742
Trainable params: 7,468,742
Non-trainable params: 0
_________________________________________________________________



Training:

Epoch 1/5
114/114 [==============================] - 663s 6s/step - loss: 3.2127 - accuracy: 0.2947
Epoch 2/5
114/114 [==============================] - 645s 6s/step - loss: 1.3449 - accuracy: 0.4488
Epoch 3/5
114/114 [==============================] - 651s 6s/step - loss: 1.0314 - accuracy: 0.5925
Epoch 4/5
114/114 [==============================] - 650s 6s/step - loss: 0.8009 - accuracy: 0.6963
Epoch 5/5
114/114 [==============================] - 633s 6s/step - loss: 0.5837 - accuracy: 0.7808