Summary:

Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 224, 224, 3)]     0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 224, 224, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 112, 112, 128)     73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 56, 56, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 28, 28, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 14, 14, 512)       2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
dense (Dense)                (None, 6)                 150534    
=================================================================
Total params: 14,865,222
Trainable params: 7,229,958
Non-trainable params: 7,635,264
_________________________________________________________________



Training:

Epoch 1/15
114/114 [==============================] - 1833s 16s/step - loss: 1.7618 - accuracy: 0.2801
Epoch 2/15
114/114 [==============================] - 1767s 15s/step - loss: 1.6293 - accuracy: 0.3217
Epoch 3/15
114/114 [==============================] - 1766s 15s/step - loss: 1.1633 - accuracy: 0.5549
Epoch 4/15
114/114 [==============================] - 1766s 15s/step - loss: 0.6289 - accuracy: 0.7978
Epoch 5/15
114/114 [==============================] - 1766s 15s/step - loss: 0.4332 - accuracy: 0.8617
Epoch 6/15
114/114 [==============================] - 1766s 15s/step - loss: 0.2991 - accuracy: 0.9033
Epoch 7/15
114/114 [==============================] - 1762s 15s/step - loss: 0.2692 - accuracy: 0.9227
Epoch 8/15
114/114 [==============================] - 1767s 15s/step - loss: 0.1795 - accuracy: 0.9445
Epoch 9/15
114/114 [==============================] - 1768s 16s/step - loss: 0.1577 - accuracy: 0.9519
Epoch 10/15
114/114 [==============================] - 1762s 15s/step - loss: 0.1178 - accuracy: 0.9630
Epoch 11/15
114/114 [==============================] - 1773s 16s/step - loss: 0.1098 - accuracy: 0.9694
Epoch 12/15
114/114 [==============================] - 1763s 15s/step - loss: 0.0961 - accuracy: 0.9706
Epoch 13/15
114/114 [==============================] - 1764s 15s/step - loss: 0.0790 - accuracy: 0.9743
Epoch 14/15
114/114 [==============================] - 1764s 15s/step - loss: 0.0693 - accuracy: 0.9792
Epoch 15/15
114/114 [==============================] - 1763s 15s/step - loss: 0.0796 - accuracy: 0.9767